

export default function PodCastsPage() {
    return (
        <div className="container mx-auto max-w-[1288px] p-8">
            <div className="grid grid-cols-1 place-items-center gap-y-5 p-20">
                <p className="font-black text-5xl">بزودی با کلی پادکست صوتی و تصویری میایم!</p>
                <svg className="w-20 h-20" xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 400 400">
                    <path stroke="#000" stroke-linecap="round" stroke-linejoin="round" stroke-opacity=".9" stroke-width="16" d="M322 368.2c-17.1.63-34.38.62-51.32 1.1M181.14 70.1c19.44-19.53 57.92-6.98 75.01 14.8 36.78 46.88 16.17 146.81-71.73 134.25-59.01-5.53-67.7-121.2-17.47-134.25M268.5 245.34c2.05-31.22 16.7-32.66 24.98-28.05 17 9.48 19.52 69.96 5.36 73.43-27.6 6.78-31.8-31.26-28.37-48.74M290.98 297.19c0 19.7 1.3 36.07 1.3 58.75M232.34 348.55c.55-29.55-.72-82.17-5.34-107.01M149.47 241.54c-26.2 30.57-34.24 74.34-39.94 120"/>
                    <path stroke="#000" stroke-linecap="round" stroke-linejoin="round" stroke-opacity=".9" stroke-width="16" d="M211.26 163.74c36.91-7.25 25.92 41.08 0 34.67-18.4-4.54-18.4-34.67-3.45-34.67M233.12 138.18c0-2.18-.37-4.52-.05-6.8M206.33 138.18v-6.8M120.17 114.16c47.51-8.3.05 91.49-10.28 30.24-1.71-10.16-3.66-22.58 2.75-31.7M271.82 116.66c7.5-5.27 16.66-9.55 19.94 2.06 11.68 55.12-29.82 62.22-20.73 9.29M121.84 104.53C126.75 6.4 276.91 4.5 288.18 100.58M225.91 241.54c17.47 51.32 41.5 87.35 68.8 111.38"/>
                </svg>
            </div>
        </div>
    )
}