import Image from "next/image"
import a from '@/assets/images/a.png'



export default function Content() {
    return (
        <div className="space-y-10">
            <div className="bg-white rounded-xl p-4 min-[400px]:p-8 space-y-5 dark:bg-[#0E2338]">
                <div className="grid grid-cols-1 gap-y-2 md:gap-y-0 place-items-center md:flex justify-between items-center">
                    <div className="grid grid-cols-1 gap-y-2 md:gap-y-0 md:flex gap-x-2 md:gap-x-4">
                        <p className="font-black text-lg dark:text-[#EEEEEE]">اسم نویسنده</p>
                        <span className="hidden md:block">|</span>
                        <p className="font-light text-base dark:text-[#EEEEEE]">تاریخ انتشار مقاله</p>
                    </div>
                    <div className="flex justify-between items-center gap-x-2">
                        <a className="bg-[#393646] rounded-full p-[6px] hover:bg-[#FF0060] duration-200 dark:bg-[#0079FF]">
                            <svg className="w-5 h-5 text-white" xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24">
                                <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="1.5" d="M9 22h6c5 0 7-2 7-7V9c0-5-2-7-7-7H9C4 2 2 4 2 9v6c0 5 2 7 7 7Z"/>
                                <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="1.5" d="M12 15.5a3.5 3.5 0 1 0 0-7 3.5 3.5 0 0 0 0 7Z"/>
                                <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="2" d="M17.64 7h0"/>
                            </svg>
                        </a>
                        <a className="bg-[#393646] rounded-full p-[6px] hover:bg-[#FF0060] duration-200 dark:bg-[#0079FF]">
                            <svg className="w-5 h-5 text-white" xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 32 32">
                                <path stroke="currentColor" strokeWidth="2" d="M29.92 6.16 25.69 26.1c-.31 1.4-1.15 1.75-2.33 1.1l-6.43-4.75-3.11 2.99c-.34.34-.63.63-1.3.63L13 19.5 24.92 8.72c.52-.46-.11-.72-.8-.26l-14.76 9.3-6.35-2c-1.38-.43-1.4-1.38.3-2.04l24.83-9.57c1.15-.43 2.15.26 1.78 2.01z"/>
                            </svg>
                        </a>
                        <a className="bg-[#393646] rounded-full p-[6px] hover:bg-[#FF0060] duration-200 dark:bg-[#0079FF]">
                            <svg className="w-5 h-5 text-white" xmlns="http://www.w3.org/2000/svg" fill="none" data-name="Layer 2" viewBox="0 0 48 48">
                                <path stroke="currentColor" strokeWidth="3" d="M38.74 16.55v1c0 10.07-7.64 21.61-21.62 21.61A21.14 21.14 0 0 1 5.5 35.71a12.22 12.22 0 0 0 1.81.11 15.25 15.25 0 0 0 9.44-3.24 7.56 7.56 0 0 1-7.1-5.29 6.9 6.9 0 0 0 1.44.15 7.53 7.53 0 0 0 2-.27A7.57 7.57 0 0 1 7 19.72v-.1a7.42 7.42 0 0 0 3.44.94A7.54 7.54 0 0 1 8.05 10.5a21.58 21.58 0 0 0 15.68 7.94 6.38 6.38 0 0 1-.21-1.74 7.55 7.55 0 0 1 13.17-5.31 15.59 15.59 0 0 0 4.83-1.85 7.65 7.65 0 0 1-3.39 4.27 15.87 15.87 0 0 0 4.37-1.26 15.56 15.56 0 0 1-3.76 4Z"/>
                            </svg>
                        </a>
                        <a className="bg-[#393646] rounded-full p-[6px] hover:bg-[#FF0060] duration-200 dark:bg-[#0079FF]">
                            <svg className="w-5 h-5 text-white" xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24">
                                <path stroke="currentColor" fill="currentColor" strokeWidth="0.1" fill-rule="evenodd" d="M6 2a4 4 0 0 0-4 4v12a4 4 0 0 0 4 4h12a4 4 0 0 0 4-4V6a4 4 0 0 0-4-4H6ZM4 6c0-1.1.9-2 2-2h12a2 2 0 0 1 2 2v12a2 2 0 0 1-2 2H6a2 2 0 0 1-2-2V6Zm5 5a1 1 0 1 0-2 0v6a1 1 0 1 0 2 0v-6Zm.5-3.5a1.5 1.5 0 1 1-3 0 1.5 1.5 0 0 1 3 0ZM12 10a1 1 0 0 1 .82.43A3.51 3.51 0 0 1 14.5 10c2.16 0 3.5 1.93 3.5 3.57V17a1 1 0 1 1-2 0V13.57c0-.78-.66-1.58-1.5-1.58-.52 0-1.1.28-1.5.96V17a1 1 0 1 1-2 0V11a1 1 0 0 1 1-1Z" clip-rule="evenodd"/>
                            </svg>
                        </a>
                    </div>
                </div>
                <div>
                    <Image src={a} className="w-full h-full rounded-md" />
                </div>
                <div className="grid grid-cols-1 place-items-center gap-y-2 min-[450px]:flex justify-between items-center">
                    <a href="#" className="bg-[#FFE3E7] flex text-[#FF0060] text-base rounded gap-x-2 p-2 hover:bg-[#FF0060] hover:text-white duration-200 dark:bg-[#FF0060] dark:text-[#EEEEEE] dark:hover:bg-[#0079FF]">برچسب مقاله
                        <svg className="w-5 h-5" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                            <path fill="currentColor" fill-rule="evenodd" d="M11.24 2.8c-.62.08-1.37.25-2.45.5l-1.23.29c-.91.2-1.54.35-2.02.52-.46.16-.72.31-.92.51-.2.2-.35.46-.51.92-.17.48-.31 1.1-.52 2.02L3.3 8.79a28.9 28.9 0 0 0-.5 2.45c-.08.6-.06 1 .04 1.37.1.37.3.72.7 1.19.39.47.94 1.02 1.72 1.8l1.83 1.84a36.3 36.3 0 0 0 3.16 2.96c.81.62 1.4.85 2.01.85.6 0 1.2-.23 2.02-.85.83-.64 1.8-1.6 3.16-2.96a36.3 36.3 0 0 0 2.96-3.16c.62-.82.85-1.41.85-2.02 0-.6-.23-1.2-.85-2.01a36.3 36.3 0 0 0-2.96-3.16L15.6 5.26a28.9 28.9 0 0 0-1.81-1.73 3.25 3.25 0 0 0-1.2-.69c-.36-.1-.76-.12-1.36-.04Zm-.2-1.49c.72-.1 1.35-.09 1.98.1.64.17 1.17.5 1.73.97.54.44 1.14 1.04 1.9 1.8l1.89 1.89c1.3 1.3 2.35 2.35 3.05 3.27a4.74 4.74 0 0 1 1.16 2.92c0 1.07-.44 1.98-1.16 2.93-.7.92-1.74 1.96-3.05 3.27l-.08.08c-1.31 1.3-2.35 2.35-3.27 3.05a4.74 4.74 0 0 1-2.93 1.16 4.74 4.74 0 0 1-2.92-1.16c-.92-.7-1.96-1.74-3.27-3.05l-1.9-1.9a29.52 29.52 0 0 1-1.8-1.89c-.46-.56-.79-1.1-.97-1.73a4.73 4.73 0 0 1-.09-1.98c.1-.7.28-1.52.52-2.55l.3-1.3c.2-.87.37-1.57.56-2.14.2-.58.45-1.07.87-1.5.42-.4.9-.66 1.5-.86.56-.2 1.26-.36 2.12-.56l1.3-.3c1.04-.24 1.87-.43 2.56-.52ZM9.5 8a1.25 1.25 0 1 0-1.77 1.76A1.25 1.25 0 0 0 9.5 8ZM6.66 6.93a2.75 2.75 0 1 1 3.9 3.9 2.75 2.75 0 0 1-3.9-3.9ZM19.06 11c.28.3.28.77 0 1.06l-6.99 6.98a.75.75 0 0 1-1.06-1.06L18 10.99c.3-.3.77-.3 1.06 0Z" clip-rule="evenodd"/>
                        </svg> 
                    </a>
                    <div className="flex gap-x-1 items-center">
                        <svg className="w-5 h-5 text-[#A3B0C6]" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                            <path fill="currentColor" fill-rule="evenodd" d="M6.25 2c0-.41.34-.75.75-.75h10a.75.75 0 0 1 0 1.5H7A.75.75 0 0 1 6.25 2Zm5.7 2.25h.1c1.36 0 2.45 0 3.31.09.89.09 1.63.28 2.28.71.52.35.96.8 1.3 1.31.44.65.63 1.39.72 2.28.09.86.09 1.95.09 3.32v.08c0 1.37 0 2.46-.09 3.32a4.83 4.83 0 0 1-.71 2.28c-.35.52-.8.96-1.31 1.3-.65.44-1.39.63-2.28.72-.86.09-1.95.09-3.32.09h-.08c-1.37 0-2.46 0-3.32-.09a4.83 4.83 0 0 1-2.28-.71c-.52-.35-.96-.8-1.3-1.31a4.83 4.83 0 0 1-.72-2.28c-.09-.86-.09-1.95-.09-3.32v-.08c0-1.37 0-2.46.09-3.32.09-.89.28-1.63.71-2.28.35-.52.8-.96 1.31-1.3a4.83 4.83 0 0 1 2.28-.72c.86-.09 1.95-.09 3.32-.09ZM8.8 5.83c-.77.08-1.23.23-1.6.47-.35.23-.66.54-.9.9-.23.36-.38.82-.46 1.59-.08.78-.08 1.79-.08 3.21s0 2.43.08 3.21c.08.77.23 1.23.47 1.6.23.35.54.66.9.9.36.23.82.38 1.59.46.78.08 1.79.08 3.21.08s2.43 0 3.21-.08a3.37 3.37 0 0 0 1.6-.47c.35-.23.66-.54.9-.9.23-.36.38-.82.46-1.59.08-.78.08-1.79.08-3.21s0-2.43-.08-3.21a3.37 3.37 0 0 0-.47-1.6 3.25 3.25 0 0 0-.9-.9 3.37 3.37 0 0 0-1.59-.46c-.78-.08-1.79-.08-3.21-.08s-2.43 0-3.21.08ZM12 8.25c.41 0 .75.34.75.75v2.76l1.77 1.7a.75.75 0 1 1-1.04 1.08L11.86 13c-.3-.3-.45-.44-.53-.63-.08-.19-.08-.4-.08-.82V9c0-.41.34-.75.75-.75ZM6.25 22c0-.41.34-.75.75-.75h10a.75.75 0 0 1 0 1.5H7a.75.75 0 0 1-.75-.75Z" clip-rule="evenodd"/>
                        </svg>
                        <p className="font-light text-base text-[#A3B0C6]">زمان مطالعه</p>
                    </div>
                </div>
                <div className="text-[#393646]">
                    <h1 className="font-black text-4xl dark:text-[#EEEEEE]">اسم مقاله</h1>
                </div>
                <div className="font-light text-xl break-words leading-10">
                    <p>جاوا اسکریپت یک زبان اسکریپت‌­نویسی (یا برنامه­‌نویسی) است که برای افزودن ویژگی­‌های پیچیده (مانند انیمیشن­‌های 2 و 3 بعدی، نقشه­‌های واکنش­‌گرا و...) به وب­‌سایت از آن استفاده می­‌شود. برنامه‌­نویسان جاوا اسکریپت به منظور کدنویسی کم­‌تر و رسیدن به نتیجه مورد نظر در کوتاه‌­ترین زمان، از فریم‌­ورک‌­های این زبان مانند Vue ، React،  Angular و... استفاده می­‌کنند. هر کدام از این فریم‌­ورک­‌ها شامل کتابخانه­‌های کوچک و بزرگ به همراه قواعد و دستورات خاص خود هستند و برنامه‌­نویسان برای انتخاب هر کدام از آن‌ها دلایل خود را دارند. شما نیز اگر در انتخاب کتابخانه­‌های جاوا اسکریپت برای یادگیری مردد هستید، ابتدا باید ویژگی­‌های هر کدام را به خوبی بشناسید. در مطالب قبلی درباره فریم‌ورک React Native صحبت کرده‌ایم و در ادامه این مقاله با فریم‌ورک در حال رشد و محبوب Vue.JS آشنا خواهیم شد.</p>
                </div>
                <div className="grid grid-cols-1 place-items-center gap-y-5 min-[600px]:flex justify-between items-center">
                    <div className="flex justify-start items-center gap-x-4 md:gap-x-2">
                        <a href="#" className="bg-gray-400 bg-opacity-20 flex items-center text-gray-500 gap-x-1 px-1 rounded">0
                            <svg className="w-4 h-4" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                                <path fill="currentColor" fill-rule="evenodd" d="M8.99 5.3a7.25 7.25 0 0 1 13.1 6.2.97.97 0 0 0-.07.66l.12.47a2.05 2.05 0 0 1-2.5 2.51l-.48-.12a.88.88 0 0 0-.47.01A8.75 8.75 0 0 1 6.23 21.9a.92.92 0 0 0-.64-.08l-1.22.32a2.05 2.05 0 0 1-2.51-2.5l.33-1.23a.92.92 0 0 0-.09-.64A8.75 8.75 0 0 1 9 5.3Zm1.74-.02a8.75 8.75 0 0 1 8 8.22c.27-.02.54 0 .81.07l.48.12c.4.11.78-.26.67-.67l-.12-.48a2.46 2.46 0 0 1 .16-1.65 5.75 5.75 0 0 0-10-5.6ZM10 6.75a7.25 7.25 0 0 0-6.54 10.38c.23.49.33 1.08.17 1.66l-.32 1.23c-.11.4.26.78.67.67l1.23-.32a2.42 2.42 0 0 1 1.66.17A7.25 7.25 0 1 0 10 6.74Z" clip-rule="evenodd"/><path fill="#1C274C" d="M7.5 14a1 1 0 1 1-2 0 1 1 0 0 1 2 0ZM11 14a1 1 0 1 1-2 0 1 1 0 0 1 2 0ZM14.5 14a1 1 0 1 1-2 0 1 1 0 0 1 2 0Z"/>
                            </svg>
                        </a>
                        <button className="bg-red-700 bg-opacity-20 flex items-center text-red-700 gap-x-1 px-1 rounded hover:bg-red-500 hover:text-white">0
                            <svg className="w-4 h-4" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                                <path fill="currentColor" fill-rule="evenodd" d="M5.62 4.42a5.14 5.14 0 0 0-2.87 4.72c0 2.2.9 3.89 2.19 5.34 1.06 1.2 2.35 2.19 3.6 3.15l.89.7c.52.4 1 .77 1.44 1.03.46.27.82.39 1.13.39.31 0 .67-.12 1.13-.39.45-.26.92-.62 1.44-1.04l.89-.69c1.25-.96 2.54-1.95 3.6-3.15a7.8 7.8 0 0 0 2.19-5.34 5.14 5.14 0 0 0-2.87-4.72c-1.62-.73-3.78-.54-5.84 1.6a.75.75 0 0 1-1.08 0C9.4 3.88 7.24 3.7 5.62 4.42Zm6.38.04C9.69 2.39 7.1 2.1 5 3.06a6.64 6.64 0 0 0-3.75 6.08 9.3 9.3 0 0 0 2.57 6.34 27.46 27.46 0 0 0 3.85 3.38l.83.64c.51.4 1.06.83 1.62 1.16.55.33 1.19.59 1.88.59s1.33-.26 1.88-.59c.56-.33 1.11-.76 1.62-1.16l.83-.64a27.47 27.47 0 0 0 3.85-3.38 9.3 9.3 0 0 0 2.57-6.34A6.64 6.64 0 0 0 19 3.06c-2.1-.96-4.69-.67-7 1.4Z" clip-rule="evenodd"/>
                            </svg>
                        </button>
                        <button className="bg-blue-500 bg-opacity-20 flex items-center text-blue-700 gap-x-1 p-1 rounded hover:bg-blue-500 hover:text-white">
                            <svg className="w-4 h-4" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                                <path fill="currentColor" d="M9 5.25a.75.75 0 0 0 0 1.5h6a.75.75 0 0 0 0-1.5H9Z"/>
                                <path fill="currentColor" fill-rule="evenodd" d="M11.94 1.25c-2.07 0-3.7 0-4.98.17A5.18 5.18 0 0 0 3.78 2.8 5.28 5.28 0 0 0 2.42 6c-.17 1.3-.17 2.94-.17 5.04v5.1c0 1.5 0 2.7.1 3.6.1.89.3 1.69.88 2.22.46.43 1.05.7 1.68.78.79.09 1.52-.29 2.25-.8a37.2 37.2 0 0 0 2.74-2.3l.04-.03c.52-.46.87-.77 1.17-.99.28-.2.45-.28.6-.31.2-.04.39-.04.58 0 .15.03.32.1.6.31.3.22.65.53 1.17.99l.04.03c1.12 1 2 1.78 2.74 2.3.73.51 1.46.89 2.25.8a2.99 2.99 0 0 0 1.68-.78c.59-.53.79-1.33.88-2.22.1-.9.1-2.1.1-3.6v-5.1c0-2.1 0-3.74-.17-5.03a5.28 5.28 0 0 0-1.36-3.2 5.18 5.18 0 0 0-3.18-1.39c-1.28-.17-2.91-.17-4.98-.17h-.12ZM4.85 3.86c.5-.5 1.17-.8 2.31-.95 1.17-.16 2.7-.16 4.84-.16 2.14 0 3.67 0 4.84.16 1.14.15 1.81.45 2.3.95.5.5.8 1.19.95 2.35.16 1.17.16 2.72.16 4.89v5c0 1.56 0 2.67-.09 3.48-.09.83-.25 1.14-.4 1.28-.24.22-.53.35-.84.39-.2.02-.54-.06-1.21-.54-.66-.46-1.49-1.2-2.66-2.23l-.02-.02a19 19 0 0 0-1.25-1.05 3.01 3.01 0 0 0-1.2-.57 2.98 2.98 0 0 0-1.17 0c-.44.09-.82.3-1.19.57a19 19 0 0 0-1.25 1.05l-.02.02c-1.17 1.04-2 1.77-2.66 2.23-.67.48-1 .56-1.2.54-.32-.04-.61-.17-.85-.39-.15-.14-.31-.45-.4-1.28a37.5 37.5 0 0 1-.09-3.49v-5c0-2.16 0-3.7.16-4.88.15-1.16.44-1.85.94-2.35Z" clip-rule="evenodd"/>
                            </svg>
                        </button>
                    </div>
                    <div className="flex flex-wrap gap-y-2 min-[300px]:justify-normal gap-x-2">
                        <div className="flex">
                            <a className="group bg-[#ECEEEF] flex flex-row-reverse items-center hover:bg-[#FF0060] hover:text-white rounded p-1 dark:bg-[#162F48] duration-200" href="#">
                                <p className="text-sm">tailwind</p>
                                <svg className="w-3 h-3 fill-current text-[#393646] hover:bg-[#FF0060] group-hover:text-white dark:text-[#EEEEEE]" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                                    <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="1.5" d="M10 3 5 21M19 3l-5 18"/>
                                    <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="1.5" d="M22 9H4M20 16H2" opacity="1"/>
                                </svg>
                            </a>
                        </div>
                        <div className="flex">
                            <a className="group bg-[#ECEEEF] flex flex-row-reverse items-center hover:bg-[#FF0060] hover:text-white rounded p-1 dark:bg-[#162F48] duration-200" href="#">
                                <p className="text-sm">جاوا_اسکریپت</p>
                                <svg className="w-3 h-3 fill-current text-[#393646] hover:bg-[#FF0060] group-hover:text-white dark:text-[#EEEEEE]" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                                    <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="1.5" d="M10 3 5 21M19 3l-5 18"/>
                                    <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="1.5" d="M22 9H4M20 16H2" opacity="1"/>
                                </svg>
                            </a>
                        </div>
                        <div className="flex">
                            <a className="group bg-[#ECEEEF] flex flex-row-reverse items-center hover:bg-[#FF0060] hover:text-white rounded p-1 dark:bg-[#162F48] duration-200" href="#">
                                <p className="text-sm">وب</p>
                                <svg className="w-3 h-3 fill-current text-[#393646] hover:bg-[#FF0060] group-hover:text-white dark:text-[#EEEEEE]" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                                    <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="1.5" d="M10 3 5 21M19 3l-5 18"/>
                                    <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="1.5" d="M22 9H4M20 16H2" opacity="1"/>
                                </svg>
                            </a>
                        </div>
                    </div>
                </div>
                <div className="grid grid-cols-1 place-items-center gap-y-7 min-[600px]:flex justify-between items-center bg-[#F3F4F6] text-[#393646] font-bold text-sm rounded-md p-3 dark:bg-[#162F48]">
                    <p className="dark:text-[#EEEEEE]">به این مقاله چه امتیازی میدی؟</p>
                    <p className="dark:text-[#EEEEEE]">ثبت رای</p>
                </div>
            </div>
            <div className="space-y-5">
                <p className="font-black text-2xl">مقالات مشابه</p>
                <div className="grid grid-cols-1 gap-y-5 gap-x-5 sm:grid-cols-3">
                    <div className="bg-white grid rounded-lg gap-y-4 p-4 dark:bg-[#0E2338]">
                        <Image className="rounded-md" src={a} alt="pic"/>
                        <h4 className="text-center min-[280px]:text-right font-black text-lg text-[#393646] dark:text-[#EEEEEE]">اسم مقاله</h4>
                        <div className="grid grid-cols-1 gap-y-2 place-items-center min-[280px]:flex min-[280px]:justify-between items-center">
                            <b className="text-xs">اسم نویسنده</b>
                            <a href="#" className="bg-[#FFE3E7] flex text-[#FF0060] text-xs rounded gap-x-2 p-1 hover:bg-[#FF0060] hover:text-white duration-200 dark:bg-[#FF0060] dark:text-[#EEEEEE] dark:hover:bg-[#0079FF]">برچسب مقاله
                                <svg className="w-4 h-4" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                                    <path fill="currentColor" fill-rule="evenodd" d="M11.24 2.8c-.62.08-1.37.25-2.45.5l-1.23.29c-.91.2-1.54.35-2.02.52-.46.16-.72.31-.92.51-.2.2-.35.46-.51.92-.17.48-.31 1.1-.52 2.02L3.3 8.79a28.9 28.9 0 0 0-.5 2.45c-.08.6-.06 1 .04 1.37.1.37.3.72.7 1.19.39.47.94 1.02 1.72 1.8l1.83 1.84a36.3 36.3 0 0 0 3.16 2.96c.81.62 1.4.85 2.01.85.6 0 1.2-.23 2.02-.85.83-.64 1.8-1.6 3.16-2.96a36.3 36.3 0 0 0 2.96-3.16c.62-.82.85-1.41.85-2.02 0-.6-.23-1.2-.85-2.01a36.3 36.3 0 0 0-2.96-3.16L15.6 5.26a28.9 28.9 0 0 0-1.81-1.73 3.25 3.25 0 0 0-1.2-.69c-.36-.1-.76-.12-1.36-.04Zm-.2-1.49c.72-.1 1.35-.09 1.98.1.64.17 1.17.5 1.73.97.54.44 1.14 1.04 1.9 1.8l1.89 1.89c1.3 1.3 2.35 2.35 3.05 3.27a4.74 4.74 0 0 1 1.16 2.92c0 1.07-.44 1.98-1.16 2.93-.7.92-1.74 1.96-3.05 3.27l-.08.08c-1.31 1.3-2.35 2.35-3.27 3.05a4.74 4.74 0 0 1-2.93 1.16 4.74 4.74 0 0 1-2.92-1.16c-.92-.7-1.96-1.74-3.27-3.05l-1.9-1.9a29.52 29.52 0 0 1-1.8-1.89c-.46-.56-.79-1.1-.97-1.73a4.73 4.73 0 0 1-.09-1.98c.1-.7.28-1.52.52-2.55l.3-1.3c.2-.87.37-1.57.56-2.14.2-.58.45-1.07.87-1.5.42-.4.9-.66 1.5-.86.56-.2 1.26-.36 2.12-.56l1.3-.3c1.04-.24 1.87-.43 2.56-.52ZM9.5 8a1.25 1.25 0 1 0-1.77 1.76A1.25 1.25 0 0 0 9.5 8ZM6.66 6.93a2.75 2.75 0 1 1 3.9 3.9 2.75 2.75 0 0 1-3.9-3.9ZM19.06 11c.28.3.28.77 0 1.06l-6.99 6.98a.75.75 0 0 1-1.06-1.06L18 10.99c.3-.3.77-.3 1.06 0Z" clip-rule="evenodd"/>
                                </svg> 
                            </a>
                        </div>
                        <div className="grid grid-cols-1 place-items-center gap-y-2 min-[325px]:flex justify-between items-center">
                            <div className="flex justify-start items-center gap-x-2">
                                <a href="#" className="bg-gray-400 bg-opacity-20 flex items-center text-gray-500 gap-x-1 px-1 rounded">0
                                    <svg className="w-4 h-4" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                                        <path fill="currentColor" fill-rule="evenodd" d="M8.99 5.3a7.25 7.25 0 0 1 13.1 6.2.97.97 0 0 0-.07.66l.12.47a2.05 2.05 0 0 1-2.5 2.51l-.48-.12a.88.88 0 0 0-.47.01A8.75 8.75 0 0 1 6.23 21.9a.92.92 0 0 0-.64-.08l-1.22.32a2.05 2.05 0 0 1-2.51-2.5l.33-1.23a.92.92 0 0 0-.09-.64A8.75 8.75 0 0 1 9 5.3Zm1.74-.02a8.75 8.75 0 0 1 8 8.22c.27-.02.54 0 .81.07l.48.12c.4.11.78-.26.67-.67l-.12-.48a2.46 2.46 0 0 1 .16-1.65 5.75 5.75 0 0 0-10-5.6ZM10 6.75a7.25 7.25 0 0 0-6.54 10.38c.23.49.33 1.08.17 1.66l-.32 1.23c-.11.4.26.78.67.67l1.23-.32a2.42 2.42 0 0 1 1.66.17A7.25 7.25 0 1 0 10 6.74Z" clip-rule="evenodd"/><path fill="#1C274C" d="M7.5 14a1 1 0 1 1-2 0 1 1 0 0 1 2 0ZM11 14a1 1 0 1 1-2 0 1 1 0 0 1 2 0ZM14.5 14a1 1 0 1 1-2 0 1 1 0 0 1 2 0Z"/>
                                    </svg>
                                </a>
                                <button className="bg-red-700 bg-opacity-20 flex items-center text-red-700 gap-x-1 px-1 rounded hover:bg-red-500 hover:text-white">0
                                    <svg className="w-4 h-4" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                                        <path fill="currentColor" fill-rule="evenodd" d="M5.62 4.42a5.14 5.14 0 0 0-2.87 4.72c0 2.2.9 3.89 2.19 5.34 1.06 1.2 2.35 2.19 3.6 3.15l.89.7c.52.4 1 .77 1.44 1.03.46.27.82.39 1.13.39.31 0 .67-.12 1.13-.39.45-.26.92-.62 1.44-1.04l.89-.69c1.25-.96 2.54-1.95 3.6-3.15a7.8 7.8 0 0 0 2.19-5.34 5.14 5.14 0 0 0-2.87-4.72c-1.62-.73-3.78-.54-5.84 1.6a.75.75 0 0 1-1.08 0C9.4 3.88 7.24 3.7 5.62 4.42Zm6.38.04C9.69 2.39 7.1 2.1 5 3.06a6.64 6.64 0 0 0-3.75 6.08 9.3 9.3 0 0 0 2.57 6.34 27.46 27.46 0 0 0 3.85 3.38l.83.64c.51.4 1.06.83 1.62 1.16.55.33 1.19.59 1.88.59s1.33-.26 1.88-.59c.56-.33 1.11-.76 1.62-1.16l.83-.64a27.47 27.47 0 0 0 3.85-3.38 9.3 9.3 0 0 0 2.57-6.34A6.64 6.64 0 0 0 19 3.06c-2.1-.96-4.69-.67-7 1.4Z" clip-rule="evenodd"/>
                                    </svg>
                                </button>
                                <button className="bg-blue-500 bg-opacity-20 flex items-center text-blue-700 gap-x-1 p-1 rounded hover:bg-blue-500 hover:text-white">
                                    <svg className="w-4 h-4" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                                        <path fill="currentColor" d="M9 5.25a.75.75 0 0 0 0 1.5h6a.75.75 0 0 0 0-1.5H9Z"/>
                                        <path fill="currentColor" fill-rule="evenodd" d="M11.94 1.25c-2.07 0-3.7 0-4.98.17A5.18 5.18 0 0 0 3.78 2.8 5.28 5.28 0 0 0 2.42 6c-.17 1.3-.17 2.94-.17 5.04v5.1c0 1.5 0 2.7.1 3.6.1.89.3 1.69.88 2.22.46.43 1.05.7 1.68.78.79.09 1.52-.29 2.25-.8a37.2 37.2 0 0 0 2.74-2.3l.04-.03c.52-.46.87-.77 1.17-.99.28-.2.45-.28.6-.31.2-.04.39-.04.58 0 .15.03.32.1.6.31.3.22.65.53 1.17.99l.04.03c1.12 1 2 1.78 2.74 2.3.73.51 1.46.89 2.25.8a2.99 2.99 0 0 0 1.68-.78c.59-.53.79-1.33.88-2.22.1-.9.1-2.1.1-3.6v-5.1c0-2.1 0-3.74-.17-5.03a5.28 5.28 0 0 0-1.36-3.2 5.18 5.18 0 0 0-3.18-1.39c-1.28-.17-2.91-.17-4.98-.17h-.12ZM4.85 3.86c.5-.5 1.17-.8 2.31-.95 1.17-.16 2.7-.16 4.84-.16 2.14 0 3.67 0 4.84.16 1.14.15 1.81.45 2.3.95.5.5.8 1.19.95 2.35.16 1.17.16 2.72.16 4.89v5c0 1.56 0 2.67-.09 3.48-.09.83-.25 1.14-.4 1.28-.24.22-.53.35-.84.39-.2.02-.54-.06-1.21-.54-.66-.46-1.49-1.2-2.66-2.23l-.02-.02a19 19 0 0 0-1.25-1.05 3.01 3.01 0 0 0-1.2-.57 2.98 2.98 0 0 0-1.17 0c-.44.09-.82.3-1.19.57a19 19 0 0 0-1.25 1.05l-.02.02c-1.17 1.04-2 1.77-2.66 2.23-.67.48-1 .56-1.2.54-.32-.04-.61-.17-.85-.39-.15-.14-.31-.45-.4-1.28a37.5 37.5 0 0 1-.09-3.49v-5c0-2.16 0-3.7.16-4.88.15-1.16.44-1.85.94-2.35Z" clip-rule="evenodd"/>
                                    </svg>
                                </button>
                            </div>
                            <div className="flex gap-x-1">
                                <svg className="w-4 h-4 text-[#A3B0C6]" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                                    <path fill="currentColor" fill-rule="evenodd" d="M6.25 2c0-.41.34-.75.75-.75h10a.75.75 0 0 1 0 1.5H7A.75.75 0 0 1 6.25 2Zm5.7 2.25h.1c1.36 0 2.45 0 3.31.09.89.09 1.63.28 2.28.71.52.35.96.8 1.3 1.31.44.65.63 1.39.72 2.28.09.86.09 1.95.09 3.32v.08c0 1.37 0 2.46-.09 3.32a4.83 4.83 0 0 1-.71 2.28c-.35.52-.8.96-1.31 1.3-.65.44-1.39.63-2.28.72-.86.09-1.95.09-3.32.09h-.08c-1.37 0-2.46 0-3.32-.09a4.83 4.83 0 0 1-2.28-.71c-.52-.35-.96-.8-1.3-1.31a4.83 4.83 0 0 1-.72-2.28c-.09-.86-.09-1.95-.09-3.32v-.08c0-1.37 0-2.46.09-3.32.09-.89.28-1.63.71-2.28.35-.52.8-.96 1.31-1.3a4.83 4.83 0 0 1 2.28-.72c.86-.09 1.95-.09 3.32-.09ZM8.8 5.83c-.77.08-1.23.23-1.6.47-.35.23-.66.54-.9.9-.23.36-.38.82-.46 1.59-.08.78-.08 1.79-.08 3.21s0 2.43.08 3.21c.08.77.23 1.23.47 1.6.23.35.54.66.9.9.36.23.82.38 1.59.46.78.08 1.79.08 3.21.08s2.43 0 3.21-.08a3.37 3.37 0 0 0 1.6-.47c.35-.23.66-.54.9-.9.23-.36.38-.82.46-1.59.08-.78.08-1.79.08-3.21s0-2.43-.08-3.21a3.37 3.37 0 0 0-.47-1.6 3.25 3.25 0 0 0-.9-.9 3.37 3.37 0 0 0-1.59-.46c-.78-.08-1.79-.08-3.21-.08s-2.43 0-3.21.08ZM12 8.25c.41 0 .75.34.75.75v2.76l1.77 1.7a.75.75 0 1 1-1.04 1.08L11.86 13c-.3-.3-.45-.44-.53-.63-.08-.19-.08-.4-.08-.82V9c0-.41.34-.75.75-.75ZM6.25 22c0-.41.34-.75.75-.75h10a.75.75 0 0 1 0 1.5H7a.75.75 0 0 1-.75-.75Z" clip-rule="evenodd"/>
                                </svg>
                                <p className="font-bold text-xs text-[#A3B0C6]">زمان مطالعه</p>
                            </div>
                        </div>
                    </div>
                    <div className="bg-white grid rounded-lg gap-y-4 p-4 dark:bg-[#0E2338]">
                        <Image className="rounded-md" src={a} alt="pic"/>
                        <h4 className="text-center min-[280px]:text-right font-black text-lg text-[#393646] dark:text-[#EEEEEE]">اسم مقاله</h4>
                        <div className="grid grid-cols-1 gap-y-2 place-items-center min-[280px]:flex min-[280px]:justify-between items-center">
                            <b className="text-xs">اسم نویسنده</b>
                            <a href="#" className="bg-[#FFE3E7] flex text-[#FF0060] text-xs rounded gap-x-2 p-1 hover:bg-[#FF0060] hover:text-white duration-200 dark:bg-[#FF0060] dark:text-[#EEEEEE] dark:hover:bg-[#0079FF]">برچسب مقاله
                                <svg className="w-4 h-4" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                                    <path fill="currentColor" fill-rule="evenodd" d="M11.24 2.8c-.62.08-1.37.25-2.45.5l-1.23.29c-.91.2-1.54.35-2.02.52-.46.16-.72.31-.92.51-.2.2-.35.46-.51.92-.17.48-.31 1.1-.52 2.02L3.3 8.79a28.9 28.9 0 0 0-.5 2.45c-.08.6-.06 1 .04 1.37.1.37.3.72.7 1.19.39.47.94 1.02 1.72 1.8l1.83 1.84a36.3 36.3 0 0 0 3.16 2.96c.81.62 1.4.85 2.01.85.6 0 1.2-.23 2.02-.85.83-.64 1.8-1.6 3.16-2.96a36.3 36.3 0 0 0 2.96-3.16c.62-.82.85-1.41.85-2.02 0-.6-.23-1.2-.85-2.01a36.3 36.3 0 0 0-2.96-3.16L15.6 5.26a28.9 28.9 0 0 0-1.81-1.73 3.25 3.25 0 0 0-1.2-.69c-.36-.1-.76-.12-1.36-.04Zm-.2-1.49c.72-.1 1.35-.09 1.98.1.64.17 1.17.5 1.73.97.54.44 1.14 1.04 1.9 1.8l1.89 1.89c1.3 1.3 2.35 2.35 3.05 3.27a4.74 4.74 0 0 1 1.16 2.92c0 1.07-.44 1.98-1.16 2.93-.7.92-1.74 1.96-3.05 3.27l-.08.08c-1.31 1.3-2.35 2.35-3.27 3.05a4.74 4.74 0 0 1-2.93 1.16 4.74 4.74 0 0 1-2.92-1.16c-.92-.7-1.96-1.74-3.27-3.05l-1.9-1.9a29.52 29.52 0 0 1-1.8-1.89c-.46-.56-.79-1.1-.97-1.73a4.73 4.73 0 0 1-.09-1.98c.1-.7.28-1.52.52-2.55l.3-1.3c.2-.87.37-1.57.56-2.14.2-.58.45-1.07.87-1.5.42-.4.9-.66 1.5-.86.56-.2 1.26-.36 2.12-.56l1.3-.3c1.04-.24 1.87-.43 2.56-.52ZM9.5 8a1.25 1.25 0 1 0-1.77 1.76A1.25 1.25 0 0 0 9.5 8ZM6.66 6.93a2.75 2.75 0 1 1 3.9 3.9 2.75 2.75 0 0 1-3.9-3.9ZM19.06 11c.28.3.28.77 0 1.06l-6.99 6.98a.75.75 0 0 1-1.06-1.06L18 10.99c.3-.3.77-.3 1.06 0Z" clip-rule="evenodd"/>
                                </svg> 
                            </a>
                        </div>
                        <div className="grid grid-cols-1 place-items-center gap-y-2 min-[325px]:flex justify-between items-center">
                            <div className="flex justify-start items-center gap-x-2">
                                <a href="#" className="bg-gray-400 bg-opacity-20 flex items-center text-gray-500 gap-x-1 px-1 rounded">0
                                    <svg className="w-4 h-4" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                                        <path fill="currentColor" fill-rule="evenodd" d="M8.99 5.3a7.25 7.25 0 0 1 13.1 6.2.97.97 0 0 0-.07.66l.12.47a2.05 2.05 0 0 1-2.5 2.51l-.48-.12a.88.88 0 0 0-.47.01A8.75 8.75 0 0 1 6.23 21.9a.92.92 0 0 0-.64-.08l-1.22.32a2.05 2.05 0 0 1-2.51-2.5l.33-1.23a.92.92 0 0 0-.09-.64A8.75 8.75 0 0 1 9 5.3Zm1.74-.02a8.75 8.75 0 0 1 8 8.22c.27-.02.54 0 .81.07l.48.12c.4.11.78-.26.67-.67l-.12-.48a2.46 2.46 0 0 1 .16-1.65 5.75 5.75 0 0 0-10-5.6ZM10 6.75a7.25 7.25 0 0 0-6.54 10.38c.23.49.33 1.08.17 1.66l-.32 1.23c-.11.4.26.78.67.67l1.23-.32a2.42 2.42 0 0 1 1.66.17A7.25 7.25 0 1 0 10 6.74Z" clip-rule="evenodd"/><path fill="#1C274C" d="M7.5 14a1 1 0 1 1-2 0 1 1 0 0 1 2 0ZM11 14a1 1 0 1 1-2 0 1 1 0 0 1 2 0ZM14.5 14a1 1 0 1 1-2 0 1 1 0 0 1 2 0Z"/>
                                    </svg>
                                </a>
                                <button className="bg-red-700 bg-opacity-20 flex items-center text-red-700 gap-x-1 px-1 rounded hover:bg-red-500 hover:text-white">0
                                    <svg className="w-4 h-4" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                                        <path fill="currentColor" fill-rule="evenodd" d="M5.62 4.42a5.14 5.14 0 0 0-2.87 4.72c0 2.2.9 3.89 2.19 5.34 1.06 1.2 2.35 2.19 3.6 3.15l.89.7c.52.4 1 .77 1.44 1.03.46.27.82.39 1.13.39.31 0 .67-.12 1.13-.39.45-.26.92-.62 1.44-1.04l.89-.69c1.25-.96 2.54-1.95 3.6-3.15a7.8 7.8 0 0 0 2.19-5.34 5.14 5.14 0 0 0-2.87-4.72c-1.62-.73-3.78-.54-5.84 1.6a.75.75 0 0 1-1.08 0C9.4 3.88 7.24 3.7 5.62 4.42Zm6.38.04C9.69 2.39 7.1 2.1 5 3.06a6.64 6.64 0 0 0-3.75 6.08 9.3 9.3 0 0 0 2.57 6.34 27.46 27.46 0 0 0 3.85 3.38l.83.64c.51.4 1.06.83 1.62 1.16.55.33 1.19.59 1.88.59s1.33-.26 1.88-.59c.56-.33 1.11-.76 1.62-1.16l.83-.64a27.47 27.47 0 0 0 3.85-3.38 9.3 9.3 0 0 0 2.57-6.34A6.64 6.64 0 0 0 19 3.06c-2.1-.96-4.69-.67-7 1.4Z" clip-rule="evenodd"/>
                                    </svg>
                                </button>
                                <button className="bg-blue-500 bg-opacity-20 flex items-center text-blue-700 gap-x-1 p-1 rounded hover:bg-blue-500 hover:text-white">
                                    <svg className="w-4 h-4" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                                        <path fill="currentColor" d="M9 5.25a.75.75 0 0 0 0 1.5h6a.75.75 0 0 0 0-1.5H9Z"/>
                                        <path fill="currentColor" fill-rule="evenodd" d="M11.94 1.25c-2.07 0-3.7 0-4.98.17A5.18 5.18 0 0 0 3.78 2.8 5.28 5.28 0 0 0 2.42 6c-.17 1.3-.17 2.94-.17 5.04v5.1c0 1.5 0 2.7.1 3.6.1.89.3 1.69.88 2.22.46.43 1.05.7 1.68.78.79.09 1.52-.29 2.25-.8a37.2 37.2 0 0 0 2.74-2.3l.04-.03c.52-.46.87-.77 1.17-.99.28-.2.45-.28.6-.31.2-.04.39-.04.58 0 .15.03.32.1.6.31.3.22.65.53 1.17.99l.04.03c1.12 1 2 1.78 2.74 2.3.73.51 1.46.89 2.25.8a2.99 2.99 0 0 0 1.68-.78c.59-.53.79-1.33.88-2.22.1-.9.1-2.1.1-3.6v-5.1c0-2.1 0-3.74-.17-5.03a5.28 5.28 0 0 0-1.36-3.2 5.18 5.18 0 0 0-3.18-1.39c-1.28-.17-2.91-.17-4.98-.17h-.12ZM4.85 3.86c.5-.5 1.17-.8 2.31-.95 1.17-.16 2.7-.16 4.84-.16 2.14 0 3.67 0 4.84.16 1.14.15 1.81.45 2.3.95.5.5.8 1.19.95 2.35.16 1.17.16 2.72.16 4.89v5c0 1.56 0 2.67-.09 3.48-.09.83-.25 1.14-.4 1.28-.24.22-.53.35-.84.39-.2.02-.54-.06-1.21-.54-.66-.46-1.49-1.2-2.66-2.23l-.02-.02a19 19 0 0 0-1.25-1.05 3.01 3.01 0 0 0-1.2-.57 2.98 2.98 0 0 0-1.17 0c-.44.09-.82.3-1.19.57a19 19 0 0 0-1.25 1.05l-.02.02c-1.17 1.04-2 1.77-2.66 2.23-.67.48-1 .56-1.2.54-.32-.04-.61-.17-.85-.39-.15-.14-.31-.45-.4-1.28a37.5 37.5 0 0 1-.09-3.49v-5c0-2.16 0-3.7.16-4.88.15-1.16.44-1.85.94-2.35Z" clip-rule="evenodd"/>
                                    </svg>
                                </button>
                            </div>
                            <div className="flex gap-x-1">
                                <svg className="w-4 h-4 text-[#A3B0C6]" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                                    <path fill="currentColor" fill-rule="evenodd" d="M6.25 2c0-.41.34-.75.75-.75h10a.75.75 0 0 1 0 1.5H7A.75.75 0 0 1 6.25 2Zm5.7 2.25h.1c1.36 0 2.45 0 3.31.09.89.09 1.63.28 2.28.71.52.35.96.8 1.3 1.31.44.65.63 1.39.72 2.28.09.86.09 1.95.09 3.32v.08c0 1.37 0 2.46-.09 3.32a4.83 4.83 0 0 1-.71 2.28c-.35.52-.8.96-1.31 1.3-.65.44-1.39.63-2.28.72-.86.09-1.95.09-3.32.09h-.08c-1.37 0-2.46 0-3.32-.09a4.83 4.83 0 0 1-2.28-.71c-.52-.35-.96-.8-1.3-1.31a4.83 4.83 0 0 1-.72-2.28c-.09-.86-.09-1.95-.09-3.32v-.08c0-1.37 0-2.46.09-3.32.09-.89.28-1.63.71-2.28.35-.52.8-.96 1.31-1.3a4.83 4.83 0 0 1 2.28-.72c.86-.09 1.95-.09 3.32-.09ZM8.8 5.83c-.77.08-1.23.23-1.6.47-.35.23-.66.54-.9.9-.23.36-.38.82-.46 1.59-.08.78-.08 1.79-.08 3.21s0 2.43.08 3.21c.08.77.23 1.23.47 1.6.23.35.54.66.9.9.36.23.82.38 1.59.46.78.08 1.79.08 3.21.08s2.43 0 3.21-.08a3.37 3.37 0 0 0 1.6-.47c.35-.23.66-.54.9-.9.23-.36.38-.82.46-1.59.08-.78.08-1.79.08-3.21s0-2.43-.08-3.21a3.37 3.37 0 0 0-.47-1.6 3.25 3.25 0 0 0-.9-.9 3.37 3.37 0 0 0-1.59-.46c-.78-.08-1.79-.08-3.21-.08s-2.43 0-3.21.08ZM12 8.25c.41 0 .75.34.75.75v2.76l1.77 1.7a.75.75 0 1 1-1.04 1.08L11.86 13c-.3-.3-.45-.44-.53-.63-.08-.19-.08-.4-.08-.82V9c0-.41.34-.75.75-.75ZM6.25 22c0-.41.34-.75.75-.75h10a.75.75 0 0 1 0 1.5H7a.75.75 0 0 1-.75-.75Z" clip-rule="evenodd"/>
                                </svg>
                                <p className="font-bold text-xs text-[#A3B0C6]">زمان مطالعه</p>
                            </div>
                        </div>
                    </div>
                    <div className="bg-white grid rounded-lg gap-y-4 p-4 dark:bg-[#0E2338]">
                        <Image className="rounded-md" src={a} alt="pic"/>
                        <h4 className="text-center min-[280px]:text-right font-black text-lg text-[#393646] dark:text-[#EEEEEE]">اسم مقاله</h4>
                        <div className="grid grid-cols-1 gap-y-2 place-items-center min-[280px]:flex min-[280px]:justify-between items-center">
                            <b className="text-xs">اسم نویسنده</b>
                            <a href="#" className="bg-[#FFE3E7] flex text-[#FF0060] text-xs rounded gap-x-2 p-1 hover:bg-[#FF0060] hover:text-white duration-200 dark:bg-[#FF0060] dark:text-[#EEEEEE] dark:hover:bg-[#0079FF]">برچسب مقاله
                                <svg className="w-4 h-4" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                                    <path fill="currentColor" fill-rule="evenodd" d="M11.24 2.8c-.62.08-1.37.25-2.45.5l-1.23.29c-.91.2-1.54.35-2.02.52-.46.16-.72.31-.92.51-.2.2-.35.46-.51.92-.17.48-.31 1.1-.52 2.02L3.3 8.79a28.9 28.9 0 0 0-.5 2.45c-.08.6-.06 1 .04 1.37.1.37.3.72.7 1.19.39.47.94 1.02 1.72 1.8l1.83 1.84a36.3 36.3 0 0 0 3.16 2.96c.81.62 1.4.85 2.01.85.6 0 1.2-.23 2.02-.85.83-.64 1.8-1.6 3.16-2.96a36.3 36.3 0 0 0 2.96-3.16c.62-.82.85-1.41.85-2.02 0-.6-.23-1.2-.85-2.01a36.3 36.3 0 0 0-2.96-3.16L15.6 5.26a28.9 28.9 0 0 0-1.81-1.73 3.25 3.25 0 0 0-1.2-.69c-.36-.1-.76-.12-1.36-.04Zm-.2-1.49c.72-.1 1.35-.09 1.98.1.64.17 1.17.5 1.73.97.54.44 1.14 1.04 1.9 1.8l1.89 1.89c1.3 1.3 2.35 2.35 3.05 3.27a4.74 4.74 0 0 1 1.16 2.92c0 1.07-.44 1.98-1.16 2.93-.7.92-1.74 1.96-3.05 3.27l-.08.08c-1.31 1.3-2.35 2.35-3.27 3.05a4.74 4.74 0 0 1-2.93 1.16 4.74 4.74 0 0 1-2.92-1.16c-.92-.7-1.96-1.74-3.27-3.05l-1.9-1.9a29.52 29.52 0 0 1-1.8-1.89c-.46-.56-.79-1.1-.97-1.73a4.73 4.73 0 0 1-.09-1.98c.1-.7.28-1.52.52-2.55l.3-1.3c.2-.87.37-1.57.56-2.14.2-.58.45-1.07.87-1.5.42-.4.9-.66 1.5-.86.56-.2 1.26-.36 2.12-.56l1.3-.3c1.04-.24 1.87-.43 2.56-.52ZM9.5 8a1.25 1.25 0 1 0-1.77 1.76A1.25 1.25 0 0 0 9.5 8ZM6.66 6.93a2.75 2.75 0 1 1 3.9 3.9 2.75 2.75 0 0 1-3.9-3.9ZM19.06 11c.28.3.28.77 0 1.06l-6.99 6.98a.75.75 0 0 1-1.06-1.06L18 10.99c.3-.3.77-.3 1.06 0Z" clip-rule="evenodd"/>
                                </svg> 
                            </a>
                        </div>
                        <div className="grid grid-cols-1 place-items-center gap-y-2 min-[325px]:flex justify-between items-center">
                            <div className="flex justify-start items-center gap-x-2">
                                <a href="#" className="bg-gray-400 bg-opacity-20 flex items-center text-gray-500 gap-x-1 px-1 rounded">0
                                    <svg className="w-4 h-4" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                                        <path fill="currentColor" fill-rule="evenodd" d="M8.99 5.3a7.25 7.25 0 0 1 13.1 6.2.97.97 0 0 0-.07.66l.12.47a2.05 2.05 0 0 1-2.5 2.51l-.48-.12a.88.88 0 0 0-.47.01A8.75 8.75 0 0 1 6.23 21.9a.92.92 0 0 0-.64-.08l-1.22.32a2.05 2.05 0 0 1-2.51-2.5l.33-1.23a.92.92 0 0 0-.09-.64A8.75 8.75 0 0 1 9 5.3Zm1.74-.02a8.75 8.75 0 0 1 8 8.22c.27-.02.54 0 .81.07l.48.12c.4.11.78-.26.67-.67l-.12-.48a2.46 2.46 0 0 1 .16-1.65 5.75 5.75 0 0 0-10-5.6ZM10 6.75a7.25 7.25 0 0 0-6.54 10.38c.23.49.33 1.08.17 1.66l-.32 1.23c-.11.4.26.78.67.67l1.23-.32a2.42 2.42 0 0 1 1.66.17A7.25 7.25 0 1 0 10 6.74Z" clip-rule="evenodd"/><path fill="#1C274C" d="M7.5 14a1 1 0 1 1-2 0 1 1 0 0 1 2 0ZM11 14a1 1 0 1 1-2 0 1 1 0 0 1 2 0ZM14.5 14a1 1 0 1 1-2 0 1 1 0 0 1 2 0Z"/>
                                    </svg>
                                </a>
                                <button className="bg-red-700 bg-opacity-20 flex items-center text-red-700 gap-x-1 px-1 rounded hover:bg-red-500 hover:text-white">0
                                    <svg className="w-4 h-4" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                                        <path fill="currentColor" fill-rule="evenodd" d="M5.62 4.42a5.14 5.14 0 0 0-2.87 4.72c0 2.2.9 3.89 2.19 5.34 1.06 1.2 2.35 2.19 3.6 3.15l.89.7c.52.4 1 .77 1.44 1.03.46.27.82.39 1.13.39.31 0 .67-.12 1.13-.39.45-.26.92-.62 1.44-1.04l.89-.69c1.25-.96 2.54-1.95 3.6-3.15a7.8 7.8 0 0 0 2.19-5.34 5.14 5.14 0 0 0-2.87-4.72c-1.62-.73-3.78-.54-5.84 1.6a.75.75 0 0 1-1.08 0C9.4 3.88 7.24 3.7 5.62 4.42Zm6.38.04C9.69 2.39 7.1 2.1 5 3.06a6.64 6.64 0 0 0-3.75 6.08 9.3 9.3 0 0 0 2.57 6.34 27.46 27.46 0 0 0 3.85 3.38l.83.64c.51.4 1.06.83 1.62 1.16.55.33 1.19.59 1.88.59s1.33-.26 1.88-.59c.56-.33 1.11-.76 1.62-1.16l.83-.64a27.47 27.47 0 0 0 3.85-3.38 9.3 9.3 0 0 0 2.57-6.34A6.64 6.64 0 0 0 19 3.06c-2.1-.96-4.69-.67-7 1.4Z" clip-rule="evenodd"/>
                                    </svg>
                                </button>
                                <button className="bg-blue-500 bg-opacity-20 flex items-center text-blue-700 gap-x-1 p-1 rounded hover:bg-blue-500 hover:text-white">
                                    <svg className="w-4 h-4" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                                        <path fill="currentColor" d="M9 5.25a.75.75 0 0 0 0 1.5h6a.75.75 0 0 0 0-1.5H9Z"/>
                                        <path fill="currentColor" fill-rule="evenodd" d="M11.94 1.25c-2.07 0-3.7 0-4.98.17A5.18 5.18 0 0 0 3.78 2.8 5.28 5.28 0 0 0 2.42 6c-.17 1.3-.17 2.94-.17 5.04v5.1c0 1.5 0 2.7.1 3.6.1.89.3 1.69.88 2.22.46.43 1.05.7 1.68.78.79.09 1.52-.29 2.25-.8a37.2 37.2 0 0 0 2.74-2.3l.04-.03c.52-.46.87-.77 1.17-.99.28-.2.45-.28.6-.31.2-.04.39-.04.58 0 .15.03.32.1.6.31.3.22.65.53 1.17.99l.04.03c1.12 1 2 1.78 2.74 2.3.73.51 1.46.89 2.25.8a2.99 2.99 0 0 0 1.68-.78c.59-.53.79-1.33.88-2.22.1-.9.1-2.1.1-3.6v-5.1c0-2.1 0-3.74-.17-5.03a5.28 5.28 0 0 0-1.36-3.2 5.18 5.18 0 0 0-3.18-1.39c-1.28-.17-2.91-.17-4.98-.17h-.12ZM4.85 3.86c.5-.5 1.17-.8 2.31-.95 1.17-.16 2.7-.16 4.84-.16 2.14 0 3.67 0 4.84.16 1.14.15 1.81.45 2.3.95.5.5.8 1.19.95 2.35.16 1.17.16 2.72.16 4.89v5c0 1.56 0 2.67-.09 3.48-.09.83-.25 1.14-.4 1.28-.24.22-.53.35-.84.39-.2.02-.54-.06-1.21-.54-.66-.46-1.49-1.2-2.66-2.23l-.02-.02a19 19 0 0 0-1.25-1.05 3.01 3.01 0 0 0-1.2-.57 2.98 2.98 0 0 0-1.17 0c-.44.09-.82.3-1.19.57a19 19 0 0 0-1.25 1.05l-.02.02c-1.17 1.04-2 1.77-2.66 2.23-.67.48-1 .56-1.2.54-.32-.04-.61-.17-.85-.39-.15-.14-.31-.45-.4-1.28a37.5 37.5 0 0 1-.09-3.49v-5c0-2.16 0-3.7.16-4.88.15-1.16.44-1.85.94-2.35Z" clip-rule="evenodd"/>
                                    </svg>
                                </button>
                            </div>
                            <div className="flex gap-x-1">
                                <svg className="w-4 h-4 text-[#A3B0C6]" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
                                    <path fill="currentColor" fill-rule="evenodd" d="M6.25 2c0-.41.34-.75.75-.75h10a.75.75 0 0 1 0 1.5H7A.75.75 0 0 1 6.25 2Zm5.7 2.25h.1c1.36 0 2.45 0 3.31.09.89.09 1.63.28 2.28.71.52.35.96.8 1.3 1.31.44.65.63 1.39.72 2.28.09.86.09 1.95.09 3.32v.08c0 1.37 0 2.46-.09 3.32a4.83 4.83 0 0 1-.71 2.28c-.35.52-.8.96-1.31 1.3-.65.44-1.39.63-2.28.72-.86.09-1.95.09-3.32.09h-.08c-1.37 0-2.46 0-3.32-.09a4.83 4.83 0 0 1-2.28-.71c-.52-.35-.96-.8-1.3-1.31a4.83 4.83 0 0 1-.72-2.28c-.09-.86-.09-1.95-.09-3.32v-.08c0-1.37 0-2.46.09-3.32.09-.89.28-1.63.71-2.28.35-.52.8-.96 1.31-1.3a4.83 4.83 0 0 1 2.28-.72c.86-.09 1.95-.09 3.32-.09ZM8.8 5.83c-.77.08-1.23.23-1.6.47-.35.23-.66.54-.9.9-.23.36-.38.82-.46 1.59-.08.78-.08 1.79-.08 3.21s0 2.43.08 3.21c.08.77.23 1.23.47 1.6.23.35.54.66.9.9.36.23.82.38 1.59.46.78.08 1.79.08 3.21.08s2.43 0 3.21-.08a3.37 3.37 0 0 0 1.6-.47c.35-.23.66-.54.9-.9.23-.36.38-.82.46-1.59.08-.78.08-1.79.08-3.21s0-2.43-.08-3.21a3.37 3.37 0 0 0-.47-1.6 3.25 3.25 0 0 0-.9-.9 3.37 3.37 0 0 0-1.59-.46c-.78-.08-1.79-.08-3.21-.08s-2.43 0-3.21.08ZM12 8.25c.41 0 .75.34.75.75v2.76l1.77 1.7a.75.75 0 1 1-1.04 1.08L11.86 13c-.3-.3-.45-.44-.53-.63-.08-.19-.08-.4-.08-.82V9c0-.41.34-.75.75-.75ZM6.25 22c0-.41.34-.75.75-.75h10a.75.75 0 0 1 0 1.5H7a.75.75 0 0 1-.75-.75Z" clip-rule="evenodd"/>
                                </svg>
                                <p className="font-bold text-xs text-[#A3B0C6]">زمان مطالعه</p>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    )
}