import Image from "next/image"
import bg from "@/assets/images/palm.png"


export default function AboutUsPageContentCard() {
    const bgStyle={
        backgroundImage: `url(${bg.src})`,
        width: '100%',
        height: '100%',
        backgroundSize: 'cover',
        backgroundRepeat: 'no-repeat',
        backgroundPosition: 'center',
      }

    return (
        <div>
            <div className="container mx-auto max-w-[1288px] p-10 rounded-lg mt-10">
                <div className="space-y-32 sm:p-2 md:p-5">
                    <div className="grid grid-cols-1 lg:grid-cols-3">
                        <div className="col-span-2 space-y-3">
                            <h3 className="flex items-center font-black text-2xl">چرا شروع به کار کردیم؟</h3>
                            <p className="font-light text-xl break-words leading-10">جاوا اسکریپت یک زبان اسکریپت‌­نویسی (یا برنامه­‌نویسی) است که برای افزودن ویژگی­‌های پیچیده (مانند انیمیشن­‌های 2 و 3 بعدی، نقشه­‌های واکنش­‌گرا و...) به وب­‌سایت از آن استفاده می­‌شود. برنامه‌­نویسان جاوا اسکریپت به منظور کدنویسی کم­‌تر و رسیدن به نتیجه مورد نظر در کوتاه‌­ترین زمان، از فریم‌­ورک‌­های این زبان مانند Vue ، React، Angular و... استفاده می­‌کنند. هر کدام از این فریم‌­ورک­‌ها شامل کتابخانه­‌های کوچک و بزرگ به همراه قواعد و دستورات خاص خود هستند و برنامه‌­نویسان برای انتخاب هر کدام از آن‌ها دلایل خود را دارند. شما نیز اگر در انتخاب کتابخانه­‌های جاوا اسکریپت برای یادگیری مردد هستید، ابتدا باید ویژگی­‌های هر کدام را به خوبی بشناسید. در مطالب قبلی درباره فریم‌ورک React Native صحبت کرده‌ایم و در ادامه این مقاله با فریم‌ورک در حال رشد و محبوب Vue.JS آشنا خواهیم شد.</p>
                        </div>
                        <svg className="hidden lg:block w-64 h-64 xl:w-96 xl:h-96" xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 400 400">
                            <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-opacity=".9" stroke-width="16" d="M297 82.43c-8.92-11.85-13.85-32.05-28.47-38.53C240.23 31.35 212.81 62.14 210 86"/>
                            <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-opacity=".9" stroke-width="16" d="M299 99.92c-.17-18.39-33-23.19-33-1.83 0 4.55 5.6 6.58 9.2 6.91M296.79 114c38.05 43.8-31.2 51-52.79 2.83M245 84.2c-7.66-5.62-10.76.57-8.01 6.8M292 99v-2M280 96v-3"/>
                            <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-opacity=".9" stroke-width="16" d="M286 130c7.92 3 13.1 2.12 20 4M202.5 95.08c-13.02-4.23-28.73 4.64-36.4 15.15-28.2 38.67-11 73.53 3.99 111.2 5.74 14.43 11.03 28.86 18.48 42.6a380.4 380.4 0 0 0 30.71 47.73c1.85 2.45 12.27 18.68 10.52 14.58M225 177c25.5 36.89 57.28 116.3 52.52 159 8.32 2.33 22.46 8.2 12.48 13-12.48 6-29 8-41 0M319 150c9.23 11.55 21.68 39.84 10.7 53M334.8 211c23.4 93.17-.8 116.37-.8 124 12.87 5.67 1.24 14.2-29 15"/>
                            <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-opacity=".9" stroke-width="16" d="M151 158c-12.54 12.62-13.72 35.14-18 45M135 187c-44.02 19.2-84.95 89.85-80.7 137M211 297c-21.53 29.46-27.2 39.46-26.35 40.3 3.14 3.14 12.96-2.12 17.5 3.93 3.7 4.92-7.24 8.15-10 7.84-2.76-.3-4.92-5.94-7.14-4.28-1.91 1.43-2.2 6.28-6.08 5-4.06-1.36-11.96-6.55-13.93-7.14M119 272c-10.17 4.22-24.06 54.66-21.38 60.06.75 1.5 4.24 1.5 4.24 4.27 0 9.6-13.07-4-13.07-1.06 0 6.53-13.85 6.75-17.32 4.26-2.22-1.6-2.04-7.2-2.47-9.6M151 303c-.5 1.37-1 43.26-1 33.54"/>
                        </svg>
                    </div>
                    <div className="grid grid-cols-1 lg:grid-cols-3">
                        <div className="col-span-2 space-y-3">
                            <h3 className="flex items-center font-black text-2xl">وبیکسل چه کمکی به شما  میکند؟</h3>
                            <p className="font-light text-xl break-words leading-10">جاوا اسکریپت یک زبان اسکریپت‌­نویسی (یا برنامه­‌نویسی) است که برای افزودن ویژگی­‌های پیچیده (مانند انیمیشن­‌های 2 و 3 بعدی، نقشه­‌های واکنش­‌گرا و...) به وب­‌سایت از آن استفاده می­‌شود. برنامه‌­نویسان جاوا اسکریپت به منظور کدنویسی کم­‌تر و رسیدن به نتیجه مورد نظر در کوتاه‌­ترین زمان، از فریم‌­ورک‌­های این زبان مانند Vue ، React، Angular و... استفاده می­‌کنند. هر کدام از این فریم‌­ورک­‌ها شامل کتابخانه­‌های کوچک و بزرگ به همراه قواعد و دستورات خاص خود هستند و برنامه‌­نویسان برای انتخاب هر کدام از آن‌ها دلایل خود را دارند. شما نیز اگر در انتخاب کتابخانه­‌های جاوا اسکریپت برای یادگیری مردد هستید، ابتدا باید ویژگی­‌های هر کدام را به خوبی بشناسید. در مطالب قبلی درباره فریم‌ورک React Native صحبت کرده‌ایم و در ادامه این مقاله با فریم‌ورک در حال رشد و محبوب Vue.JS آشنا خواهیم شد.</p>
                        </div>
                        <svg className="hidden lg:block order-first w-64 h-64 xl:w-96 xl:h-96 scale-x-[-1]" xmlns="http://www.w3.org/2000/svg" width="800" height="800" fill="none" viewBox="0 0 400 400">
                            <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-opacity=".9" stroke-width="16" d="M111.89 219.47c32.55-71.88 170.21-124.04 215.24-86.71 34.93 28.96 27.17 108.75 4.55 142.5-8.3 12.4-62.9 39.72-62.9 20.37 0-14.12 62.85-11.58 53.05 12.82-15.77 39.2-159.33 6.06-189.48-6.8-14.53-6.19-27.21-22.27-30.31-37.69-1.49-7.4 7.57-22.62 0-22.62-10.21 0-23.2 29.79-40.17 31.67-35.14 3.88 18.94-44.16 18.94-47.5 0-12.8-22.93-16.24-8.33-33.18 7.02-8.15 18.34 6.75 23.5 11.3"/>
                            <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-opacity=".9" stroke-width="14" d="M243.91 81.02c5.01-4.1 13.97-10.55 20.07-4.46 12.05 12.04 4.31 43.8 8.17 43.8 7.93 0-1.18-16.07.75-23.76 2.96-11.81 12.33-34.2 26-17.8M241.74 287.09v-1.97" opacity=".5"/>
                        </svg>
                    </div>
                    <div className="grid grid-cols-1 lg:grid-cols-3">
                        <div className="col-span-2 space-y-3">
                            <h3 className="flex items-center font-black text-2xl">چرا شروع به کار کردیم؟</h3>
                            <p className="font-light text-xl break-words leading-10">جاوا اسکریپت یک زبان اسکریپت‌­نویسی (یا برنامه­‌نویسی) است که برای افزودن ویژگی­‌های پیچیده (مانند انیمیشن­‌های 2 و 3 بعدی، نقشه­‌های واکنش­‌گرا و...) به وب­‌سایت از آن استفاده می­‌شود. برنامه‌­نویسان جاوا اسکریپت به منظور کدنویسی کم­‌تر و رسیدن به نتیجه مورد نظر در کوتاه‌­ترین زمان، از فریم‌­ورک‌­های این زبان مانند Vue ، React، Angular و... استفاده می­‌کنند. هر کدام از این فریم‌­ورک­‌ها شامل کتابخانه­‌های کوچک و بزرگ به همراه قواعد و دستورات خاص خود هستند و برنامه‌­نویسان برای انتخاب هر کدام از آن‌ها دلایل خود را دارند. شما نیز اگر در انتخاب کتابخانه­‌های جاوا اسکریپت برای یادگیری مردد هستید، ابتدا باید ویژگی­‌های هر کدام را به خوبی بشناسید. در مطالب قبلی درباره فریم‌ورک React Native صحبت کرده‌ایم و در ادامه این مقاله با فریم‌ورک در حال رشد و محبوب Vue.JS آشنا خواهیم شد.</p>
                        </div>
                        <svg className="hidden lg:block w-64 h-64 xl:w-96 xl:h-96 dark:text-[#EEEEEE]" xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 400 400">
                            <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-opacity=".9" stroke-width="16" d="M236.14 104.28c-12.16-16.29-49.08-22.3-68.06-3.35-39 38.96-40.07 220.75 19.1 242.9 29.84 11.19 61.43-33.21 28.98-49.42-19.87-9.92-36.69 16.98-16.97 26.83"/>
                            <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-opacity=".9" stroke-width="16" d="M172.2 331.98c-49.83-75.39 45.19-60.67 37.45-121.71-1.65-13.04-25.46-48.73-24.09-52.8.36-1.06 23.34.9 37.3-8.3 13.97-9.19 13.14-16.55 14.13-16.55 8.45 0 25.45 3 30.5 7.2 5.04 4.22 4.26-29.45 1.66-24.88-2.21 3.9-21.33 6.67-28.1 0-.73-3.25-2.37-6.8-4.9-10.66M203 88.09c-2.42-2.16-9.35-6.86-20.8-14.09-5.12 8.74-9.92 14.14-14.4 16.2-5.15 2.38-15.71-1.67-16.84 3.53-1.75 8.05 6.42 16.52 2.3 25.4-1.14 2.44-4.26 7.93-7.66 8.46-2.28.34-6.89-2.84-6.89-.7 0 8.8 14.82 15.75 10.72 29.61-1.06 3.57-4.23 8.07-8.42 9.17-2.8.74-8.42-4.8-8.42-2.11 0 8.82 8.85 17.2 7.65 28.2-.43 4.02-2.51 8.27-6.88 9.88-.69.26-5.36-1.04-5.36-.7 0 9.8 16.96 9.37 6.89 31.03"/>
                        </svg>
                    </div>
                    <div className="grid grid-cols-1 place-items-center gap-y-10">
                        <h2 className="font-black text-3xl md:text-5xl underline underline-offset-auto decoration-[#FF0060] decoration-4 decoration">تیم وبیکسل</h2>
                        <div className="grid grid-cols-1 gap-y-10 md:flex justify-center items-center md:gap-x-48">
                            <div className="grid grid-cols-1 place-items-center gap-y-2 rounded-md md:p-6">
                                <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 400 400">
                                    <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-opacity=".9" stroke-width="16" d="M152.6 170.87c24.65-.09 51.82-1.76 76.2-.86M210.26 182.07c2.03-3.55 1.24-9.01 0-11.2M169.66 183.2c.08-4.12-.18-8.24-.5-12.33M260.18 290.77c37.52 4.46 71.01 40.96 86.29 62.75M130 292c-54.43 16.19-64.91 36.24-76 62M128.36 207.84c-10.6 12.31-16.77 64.46 7.2 24.62.46-.77-21.29 37.47-13.88 36.41 9.14-1.3 27.43-26.75 27.77-26.67 1.75.44-6.92 11.34-7.2 11.8-4.76 7.77-8.04 17.66-11.31 26.15-6.85 17.75 29.31-26.66 27.77-22.05-1.84 5.5-23.78 40.3-13.89 43.6 11.79 3.91 24.45-34.75 25.72-43.6"/>
                                    <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-opacity=".9" stroke-width="16" d="M263.7 206.72c.9 4.68 16.05 29.12 12.85 33.91-2.5 3.74-24.6-18.1-23.15-16.44 18.67 21.31 36.31 76.36-8.74 13.36-5.56-7.78 14.79 54.12 13.38 56-2.54 3.38-23.55-36.8-25.2-36.48-2.02.4 15.71 35.66 7.7 37-8.32 1.38-11.87-21.29-12.85-26.2M180.62 252.85c8.27-18.34 13.43 6.64 16.23 5.37 3.6-1.64 2.92-10.65 6.08-13.44 5.82-5.15 5.8 9.84 6.59 9.68 6.58-1.4 7.9-11.22 13.69 1.07M173.9 294.13c7.93 13.95 36.15 15.09 43.7 2.2M135.95 99.15C134.24 57.82 146.59 37 212.8 43.02c11.67 1.06 24.22 1.85 31.7 8.64"/>
                                    <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-opacity=".9" stroke-width="16" d="M160.45 114.84c58-79.9 106.88-22.15 116.54-8.6"/>
                                    <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-opacity=".9" stroke-width="16" d="M200.8 120.22c4.4-4.78 9.24-7.86 19-15 39.38-28.83 52.8 52.67 42.82 83.57M132.44 100.35c-18.36-13.27-31.55 34.15-23.22 46.98M118.01 174.87c-14.11-2.07-8 26.4 6.59 21.8"/>
                                    <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-opacity=".9" stroke-width="16" d="M264.67 181.16c24.33-24.92 22.58 15.31 2.67 22.2"/>
                                </svg>
                                <p className="font-black text-lg">جاویدان</p>
                                <p className="font-light text-lg">بنیانگذار وبیکسل</p>
                            </div>
                            <div className="grid grid-cols-1 place-items-center gap-y-2 rounded-md md:p-6 -translate-y-3">
                                <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 400 400">
                                    <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-opacity=".9" stroke-width="16" d="M158 183c21.99-.08 46.23-1.56 68-.76M209.45 193c1.8-3.17 1.1-8.04 0-10M173.21 194c.08-3.67-.16-7.34-.44-11M259 277c36.52 3.98 69.13 36.56 84 56M131 279c-53 15.4-63.2 34.48-74 59M141.12 107c-1.34-47.73 8.31-71.77 60.1-64.82 9.12 1.22 18.94 2.13 24.78 9.97M162 119c51.76-69.38 95.38-19.23 104-7.47"/>
                                    <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-opacity=".9" stroke-width="16" d="M199 125.57c3.93-4.21 8.25-6.92 16.96-13.22 35.14-25.4 47.11 46.42 38.22 73.65M139 108.02c-17.1-11.57-29.38 29.8-21.62 40.98M129.04 177c-13.32 0-8.52 28.8 2.96 24.58M134 213c-2.28 13.7-3 35.5-3 45M259 181.67c24.43-22.25 22.67 13.66 2.68 19.8M256 213v28M135 258.4c6.77-6.8 13.67-14.22 22.43-18.13 16.77-7.47 45-7.9 62.91-3.24 10.33 2.69 25.63 19.25 28.66 23.97M130 281.97c10.55 67.11 20.5 76.37 62.5 76.37 34.5 0 58.94-56.7 60.35-69.52.48-4.27 2.33-13.32 0-16.82M183.5 261c16.5.29 2.63 0 19.67 0"/>
                                </svg>
                                <p className="font-black text-lg">آقای ایکس</p>
                                <p className="font-light text-lg">مدیر فنی وبیکسل</p>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    )
}